Revit 2027 API
ExternalServiceRegistry Methods
The ExternalServiceRegistry type exposes the following members.
Methods
Name | Description
ExecuteService(Guid, IExternalData) |  Execute a service independently of any document.
ExecuteService(Guid, Document, IExternalData) |  Execute the service for the given document.
ExecuteService(Guid, Guid, IExternalData) |  Execute the service by the given server.
GetService |  Returns an instance of an object that represents the external service with the given Id.
GetServices |  Returns a collection of all external services currently registered in Revit.
RegisterService(ISingleServerService, ExternalServiceOptions) |  A method to register a single-server service.
RegisterService(IMultiServerService, ExternalServiceOptions, ExecutionPolicy) |  A method to register a multi-server service.
RegisterService(ISingleServerService, Guid, ExternalServiceOptions) |  A method to register a mandatory, single-server service.
Top
See Also
Reference
ExternalServiceRegistry Class
Autodesk.Revit.DB.ExternalService Namespace